Repository: Vorkytaka/mini_hydro
Catalog: miniHydro/*.lproj/Localizable.strings
Languages: ru

# WELCOME__WELCOME_TO
source: Welcome to
ru: Добро пожаловать в

# WELCOME__HINT_1_TITLE
source: Stay Hydrated
ru: Пейте воду

# WELCOME__HINT_1_DESCRIPTION
source: Quickly log your water intake with just one tap.
ru: Быстро фиксируйте своё потребление воды одним нажатием.

# WELCOME__HINT_2_TITLE
source: Permission Needed
ru: Требуется разрешение

# WELCOME__HINT_2_DESCRIPTION
source: We only need permission to save your water intake to Apple Health.
ru: Нам нужно разрешение только для сохранения данных о потреблении воды в Apple Health.

# WELCOME__HINT_3_TITLE
source: Your Privacy Matters
ru: Ваша приватность важна

# WELCOME__HINT_3_DESCRIPTION
source: We don't read or access any other data.
ru: Мы не читаем и не получаем доступ к другим данным.

# WELCOME__BUTTON
source: Grand permission
ru: Предоставить разрешение

# REJECT__TITLE
source: We Need Your Permission
ru: Нам нужно ваше разрешение

# REJECT__EXPLANATION
source: To help you stay on top of your hydration goals, we need permission to update your water intake in the Apple Health app.
ru: Чтобы помочь вам следить за целями по гидратации, нам необходимо разрешение обновлять данные о потреблении воды в приложении Apple Health.

# REJECT__INSTRUCTION_TITLE
source: How to Grant Permission:
ru: Как предоставить разрешение:

# REJECT__INSTRUCTION_BODY
source: 1. Open the Settings app on your iPhone. 2. Tap on Health settings. 3. Open Data Access & Devices. 4. Find and select miniHydro from the list. 5. Toggle on the permission to update your Water Intake.
ru: 1. Откройте приложение Настройки на вашем iPhone. 2. Нажмите на настройки Здоровья. 3. Откройте Доступ к данным и устройства. 4. Найдите и выберите miniHydro из списка. 5. Включите разрешение на обновление данных о потреблении воды.

# REJECT__OPEN_SETTINGS
source: Open settings
ru: Открыть настройки

# VOLUME__EXPLANATION
source: To help you track your water intake, we need to know the volume of the glass or bottle you typically use.
ru: Чтобы помочь вам отслеживать потребление воды, нам нужно знать объём стакана или бутылки, которой вы обычно используете.

# VOLUME__ERROR
source: Invalid input. Please enter a positive number for the bottle volume.
ru: Неверное значение. Введите объем вашей бутылки.

# VOLUME__HINT
source: Volume
ru: Объём

# VOLUME__ML
source: ml
ru: мл

# VOLUME__SUBMIT
source: Submit
ru: Продолжить

# MAIN__UPDATE_BOTTLE
source: Update bottle
ru: Изменить бутылку

# MAIN__SAVE_SUCCESS
source: Water logged! ðŸ’§
ru: Данные о воде сохранены! 💧

# MAIN__SAVE_ERROR
source: Error saving to Health. Try again.
ru: Ошибка сохранения. Попробуйте снова.

# WIDGET__TITLE
source: Hydrate button
ru: Водяная кнопка

# WIDGET__DESCRIPTION
source: Instantly record your intake from your home screen.
ru: Быстро сохраняйте выпитую воду с главного экрана.
